#![allow(clippy::ptr_arg)]

use super::jsondict::*;
use super::epwing::*;

use regex::Regex;
use lazy_static::*;

fn shinmeikai_heading_rendering(reading: &String, spellings : &Vec<String>) -> String
{
    let mut out = reading.clone();
    for spelling in spellings
    {
        if spelling.as_str() != ""
        {
            out = format!("{}【{}】", out, spelling);
        }
    }
    out
}

fn shinmeikai_strip_second_heading(definition : &mut Vec<String>, reading: &String, spellings : &Vec<String>)
{
    if !definition.is_empty()
    {
        definition[0] = definition[0].replacen(&shinmeikai_heading_rendering(&reading, &spellings), "Info: ", 1);
        if definition[0].as_str() == "Info: "
        {
            definition.remove(0);
        }
    }
}

fn shinmeikai_strip_examples(definition : &mut Vec<String>)
{
    let re = Regex::new("^「.*」$").unwrap();
    let mut i = 0;
    while i < definition.len()
    {
        if re.is_match(&definition[i])
        {
            definition.remove(i);
        }
        else
        {
            i += 1;
        }
    }
}

pub (crate) fn convert_shinmeikai_5(entry : &EpwingEntry) -> Option<JsonEntry>
{
    if let (Some(mut definition), Some((reading, spellings))) = (shinmeikai_body_converter(&entry.text), shinmeikai_heading_converter(&entry.heading))
    {
        shinmeikai_strip_second_heading(&mut definition, &reading, &spellings);
        Some(JsonEntry{r:reading, s:spellings, l:definition})
    }
    else
    {
        None
    }
}

pub (crate) fn convert_shinmeikai_5_no_examples(entry : &EpwingEntry) -> Option<JsonEntry>
{
    if let (Some(mut definition), Some((reading, spellings))) = (shinmeikai_body_converter(&entry.text), shinmeikai_heading_converter(&entry.heading))
    {
        shinmeikai_strip_second_heading(&mut definition, &reading, &spellings);
        shinmeikai_strip_examples(&mut definition);
        Some(JsonEntry{r:reading, s:spellings, l:definition})
    }
    else
    {
        None
    }
}

fn shinmeikai_is_kana_toc(list : &Vec<String>) -> bool
{
    let re = Regex::new("^・.*〜.*$").unwrap();
    if list.len() > 2
    {
        for entry in &list[2..]
        {
            if !re.is_match(entry)
            {
                return false;
            }
        }
        return true;
    }
    false
}
fn shinmeikai_is_kana_kanji_ref(list : &Vec<String>) -> bool
{
    let re = Regex::new("^（.*）[ ]*→【字音語の造語成分】$").unwrap();
    if list.len() == 2
    {
        return re.is_match(&list[1]);
    }
    false
}

fn shinmeikai_body_converter(body : &String) -> Option<Vec<String>>
{
    let body = shinmeikai_gaiji_fixer(body.as_str());
    
    let mut entries : Vec<String> = body.trim().split('\n').map(|s| s.to_string()).collect();
    let definition = entries.drain(..).map(|mut s| s.drain(..).collect()).collect();
    
    if shinmeikai_is_kana_toc(&definition) || shinmeikai_is_kana_kanji_ref(&definition)
    {
        return None;
    }
    
    Some(definition)
}

fn shinmeikai_heading_converter(heading : &String) -> Option<(String, Vec<String>)>
{
    let heading = shinmeikai_gaiji_fixer(heading.as_str());
    
    let mut reading = vec!();
    let mut spellings = vec!();
    let heading_chars = heading.chars().collect::<Vec<char>>();
    let mut i = 0;
    let mut mode = 0; // 0 : reading; 1 : spelling; 2 : after spelling
    while i < heading_chars.len()
    {
        match mode
        {
            0 =>
            {
                match heading_chars[i]
                {
                    '［' => return None, // kanji entry
                    '【' =>
                    {
                        spellings.push(vec!());
                        mode = 1;
                    }
                    ' ' | '[' => break,
                    '】' => panic!("unknown state"),
                    c => reading.push(c)
                }
            }
            1 =>
            {
                match heading_chars[i]
                {
                    '】' => mode = 2,
                    '[' | '【' | '［' | ' ' => panic!("unknown state"),
                    c => spellings.last_mut().unwrap().push(c),
                }
            }
            2 =>
            {
                match heading_chars[i]
                {
                    '【' =>
                    {
                        spellings.push(vec!());
                        mode = 1;
                    }
                    _ => break
                }
            }
            _ => panic!("unknown state")
        }
        i += 1;
    }
    let reading = reading.drain(..).collect();
    let mut spellings : Vec<String> = spellings.drain(..).map(|mut s| s.drain(..).collect()).collect();
    if spellings.is_empty()
    {
        spellings.push("".to_string());
    }
    Some((reading, spellings))
}

fn shinmeikai_gaiji_fixer(text : &str) -> String
{
    let mut text = text.to_string();
    
    for mapping in GAIJI_MAPPING.iter()
    {
        text = text.replace(mapping.0, mapping.1);
    }
    text
}

lazy_static! {
    static ref GAIJI_MAPPING : Vec<(&'static str, &'static str)> = vec!(
      ("{{n_41258}}", "©"),
      ("{{n_41285}}", "Ä"),
      ("{{n_41286}}", "Å"),
      ("{{n_41290}}", "É"),
      ("{{n_41312}}", "ß"),
      ("{{n_41313}}", "à"),
      ("{{n_41314}}", "á"),
      ("{{n_41315}}", "â"),
      ("{{n_41316}}", "ã"),
      ("{{n_41317}}", "ä"),
      ("{{n_41318}}", "å"),
      ("{{n_41320}}", "ç"),
      ("{{n_41321}}", "è"),
      ("{{n_41322}}", "é"),
      ("{{n_41323}}", "ê"),
      ("{{n_41324}}", "ë"),
      ("{{n_41326}}", "í"),
      ("{{n_41327}}", "î"),
      ("{{n_41328}}", "ï"),
      ("{{n_41330}}", "ñ"),
      ("{{n_41332}}", "ó"),
      ("{{n_41333}}", "ô"),
      ("{{n_41335}}", "ö"),
      ("{{n_41340}}", "û"),
      ("{{n_41341}}", "ü"),
      ("{{n_41508}}", "ā"),
      ("{{n_41526}}", "ē"),
      ("{{n_41550}}", "ī"),
      ("{{n_41584}}", "ō"),
      ("{{n_41590}}", "œ"),
      ("{{w_45089}}", "厲"),
      ("{{w_45090}}", "呍"),
      ("{{w_45091}}", "嘻"),
      ("{{w_45092}}", "噯"),
      ("{{w_45093}}", "圮"),
      ("{{w_45094}}", "壔"),
      ("{{w_45095}}", "彀"),
      ("{{w_45096}}", "挘"),
      ("{{w_45097}}", "摹"),
      ("{{w_45098}}", "攙"),
      ("{{w_45099}}", "腊"),
      ("{{w_45100}}", "柹"),
      ("{{w_45101}}", "枘"),
      ("{{w_45102}}", "杻"),
      ("{{w_45103}}", "梛"),
      ("{{w_45104}}", "棰"),
      ("{{w_45105}}", "步"),
      ("{{w_45106}}", "汴"),
      ("{{w_45107}}", "洎"),
      ("{{w_45108}}", "炷"),
      ("{{w_45109}}", "焮"),
      ("{{w_45110}}", "牓"),
      ("{{w_45111}}", "犛"),
      ("{{w_45112}}", "狀"),
      ("{{w_45113}}", "獐"),
      ("{{w_45114}}", "玕"),
      ("{{w_45115}}", "痀"),
      ("{{w_45116}}", "痤"),
      ("{{w_45117}}", "瘭"),
      ("{{w_45118}}", "矻"),
      ("{{w_45119}}", "砰"),
      ("{{w_45120}}", "确"),
      ("{{w_45121}}", "硼"),
      ("{{w_45122}}", "窠"),
      ("{{w_45123}}", "筩"),
      ("{{w_45124}}", "箙"),
      ("{{w_45125}}", "簏"),
      ("{{w_45126}}", "糗"),
      ("{{w_45127}}", "糁"),
      ("{{w_45128}}", "絓"),
      ("{{w_45129}}", "縕"),
      ("{{w_45130}}", "縠"),
      ("{{w_45131}}", "者"),
      ("{{w_45132}}", "耺"),
      ("{{w_45133}}", "著"),
      ("{{w_45134}}", "蕞"),
      ("{{w_45135}}", "薏"),
      ("{{w_45136}}", "﨟"),
      ("{{w_45139}}", "虬"),
      ("{{w_45140}}", "蜋"),
      ("{{w_45141}}", "螈"),
      ("{{w_45142}}", "螭"),
      ("{{w_45143}}", "袪"),
      ("{{w_45144}}", "裱"),
      ("{{w_45145}}", "褊"),
      ("{{w_45146}}", "覯"),
      ("{{w_45147}}", "跗"),
      ("{{w_45148}}", "踠"),
      ("{{w_45149}}", "⻌"),
      ("{{w_45150}}", "邃"),
      ("{{w_45151}}", "邈"),
      ("{{w_45152}}", "酴"),
      ("{{w_45153}}", "醞"),
      ("{{w_45154}}", "釃"),
      ("{{w_45155}}", "鐔"),
      ("{{w_45156}}", "韛"),
      ("{{w_45157}}", "髤"),
      ("{{w_45158}}", "魞"),
      ("{{w_45159}}", "鮐"),
      ("{{w_45160}}", "麼"),
      ("{{w_45161}}", "鼯"),
      ("{{w_45162}}", "潭"),
      ("{{w_45163}}", "莽"),
      ("{{w_45164}}", "捥"),
      ("{{w_45165}}", "楤"),
      ("{{w_45166}}", "丰"),
      ("{{w_45167}}", "嚮"),
      ("{{w_45169}}", "痎"),
      ("{{w_45175}}", "<unencoded>"),
      ("{{w_45176}}", "嗩"),
      ("{{w_45177}}", "噉"),
      ("{{w_45178}}", "囻"),
      ("{{w_45179}}", "䨔"),
      ("{{w_45180}}", "亗"),
      ("{{w_45181}}", "灵"),
      ("{{w_45182}}", "犱"),
      ("{{w_45345}}", "潢"),
      ("{{w_45346}}", "蘘"),
      ("{{w_45347}}", "蔲"),
      ("{{w_45348}}", "莔"),
      ("{{w_45349}}", "蕈"),
      ("{{w_45350}}", "莧"),
      ("{{w_45351}}", "苆"),
      ("{{w_45352}}", "惝"),
      ("{{w_45353}}", "怳"),
      ("{{w_45354}}", "膞"),
      ("{{w_45355}}", "楉"),
      ("{{w_45356}}", "逹"),
      ("{{w_45358}}", "秊"),
      ("{{w_45359}}", "箶"),
      ("{{w_45360}}", "簺"),
      ("{{w_45361}}", "籡"),
      ("{{w_45362}}", "箵"),
      ("{{w_45363}}", "篼"),
      ("{{w_45364}}", "鵃"),
      ("{{w_45365}}", "鴹"),
      ("{{w_45366}}", "<unencoded>"),
      ("{{w_45367}}", "蛚"),
      ("{{w_45368}}", "蠰"),
      ("{{w_45369}}", "蟫"),
      ("{{w_45370}}", "釄"),
      ("{{w_45371}}", "醁"),
      ("{{w_45372}}", "鍉"),
      ("{{w_45374}}", "〳"),
      ("{{w_45375}}", "〵"),
      ("{{w_45396}}", "゜"),
      ("{{w_45397}}", "！"),
      ("{{w_45398}}", "！"),
      ("{{w_45399}}", "‼"),
      ("{{w_45400}}", "<unencoded>"),
      ("{{w_45401}}", "〱"),
      ("{{w_45403}}", "●"),
      ("{{w_45404}}", "○"),
      ("{{w_45405}}", "﹅"),
      ("{{w_45406}}", "〝"),
      ("{{w_45407}}", "〞"),
      ("{{w_45411}}", "〟"),
      ("{{w_45415}}", "<unencoded>"),
      ("{{w_45416}}", "<unencoded>"),
      ("{{w_45417}}", "∓"),
      ("{{w_45419}}", "≠"),
      ("{{w_45420}}", "≓"),
      ("{{w_45421}}", "√"),
      ("{{w_45422}}", "　"),
      ("{{w_45423}}", "2"),
      ("{{w_45424}}", "5"),
      ("{{w_45425}}", "℉"),
      ("{{w_45427}}", "㎜"),
      ("{{w_45428}}", "㎞"),
      ("{{w_45429}}", "lb"),
      ("{{w_45430}}", "㏄"),
      ("{{w_45431}}", "㎾"),
      ("{{w_45432}}", "〽"),
      ("{{w_45434}}", "〄"),
      ("{{w_45435}}", "♠"),
      ("{{w_45436}}", "♥"),
      ("{{w_45610}}", "〰"),
      ("{{w_45611}}", "┈"),
      ("{{w_45618}}", "“"),
      ("{{w_45619}}", "”"),
      ("{{w_45620}}", "ﬀ"),
      ("{{w_45624}}", "Å"),
      ("{{w_45654}}", "Ω"),
      ("{{w_45659}}", "µ"),
      ("{{w_45661}}", "π"),
      ("{{w_45662}}", "µc"),
      ("{{w_45667}}", "〘"),
      ("{{w_45669}}", "〙"),
      ("{{w_45670}}", "𠆢"),
      ("{{w_45673}}", "Δ"),
      ("{{w_45674}}", "蕺"),
      ("{{w_45675}}", "噦"),
      ("{{w_45676}}", "唳"),
      ("{{w_45678}}", "墝"),
      ("{{w_45679}}", "埵"),
      ("{{w_45680}}", "墎"),
      ("{{w_45681}}", "搢"),
      ("{{w_45683}}", "湑"),
      ("{{w_45684}}", "濹"),
      ("{{w_45685}}", "桛"),
      ("{{w_45686}}", "梣"),
      ("{{w_45687}}", "樏"),
      ("{{w_45688}}", "梻"),
      ("{{w_45689}}", "橐"),
      ("{{w_45690}}", "梘"),
      ("{{w_45691}}", "梲"),
      ("{{w_45692}}", "橅"),
      ("{{w_45693}}", "檉"),
      ("{{w_45694}}", "樝"),
      ("{{w_45857}}", "梂"),
      ("{{w_45858}}", "桀"),
      ("{{w_45859}}", "胼"),
      ("{{w_45860}}", "腭"),
      ("{{w_45861}}", "胳"),
      ("{{w_45862}}", "鰧"),
      ("{{w_45863}}", "玫"),
      ("{{w_45864}}", "琰"),
      ("{{w_45865}}", "瑇"),
      ("{{w_45866}}", "麬"),
      ("{{w_45867}}", "硑"),
      ("{{w_45868}}", "硨"),
      ("{{w_45869}}", "磲"),
      ("{{w_45870}}", "裰"),
      ("{{w_45871}}", "袘"),
      ("{{w_45872}}", "篊"),
      ("{{w_45873}}", "笧"),
      ("{{w_45874}}", "簁"),
      ("{{w_45875}}", "笄"),
      ("{{w_45876}}", "簎"),
      ("{{w_45877}}", "籆"),
      ("{{w_45878}}", "筬"),
      ("{{w_45879}}", "籙"),
      ("{{w_45880}}", "笭"),
      ("{{w_45881}}", "粏"),
      ("{{w_45882}}", "糈"),
      ("{{w_45883}}", "紇"),
      ("{{w_45884}}", "蟖"),
      ("{{w_45885}}", "蚸"),
      ("{{w_45886}}", "蜓"),
      ("{{w_45887}}", "蜾"),
      ("{{w_45888}}", "螇"),
      ("{{w_45889}}", "蠁"),
      ("{{w_45890}}", "鈸"),
      ("{{w_45891}}", "錑"),
      ("{{w_45892}}", "鎺"),
      ("{{w_45893}}", "鍰"),
      ("{{w_45894}}", "鏁"),
      ("{{w_45896}}", "魳"),
      ("{{w_45897}}", "鯎"),
      ("{{w_45898}}", "鮄"),
      ("{{w_45899}}", "鱩"),
      ("{{w_45900}}", "鯁"),
      ("{{w_45901}}", "鯇"),
      ("{{w_45902}}", "鮞"),
      ("{{w_45903}}", "鰖"),
      ("{{w_45904}}", "鮸"),
      ("{{w_45905}}", "鯷"),
      ("{{w_45906}}", "魬"),
      ("{{w_45907}}", "鱝"),
      ("{{w_45908}}", "鱏"),
      ("{{w_45909}}", "鱓"),
      ("{{w_45910}}", "孒"),
      ("{{w_45911}}", "习"),
      ("{{w_45912}}", "义"),
      ("{{w_45913}}", "㕞"),
      ("{{w_45914}}", "厴"),
      ("{{w_45916}}", "尩"),
      ("{{w_45917}}", "邌"),
      ("{{w_45919}}", "离"),
      ("{{w_45920}}", "蠃"),
      ("{{w_45921}}", "劄"),
      ("{{w_45923}}", "愒"),
      ("{{w_45924}}", "彔"),
      ("{{w_45925}}", "彽"),
      ("{{w_45926}}", "邙"),
      ("{{w_45927}}", "貛"),
      ("{{w_45928}}", "攲"),
      ("{{w_45930}}", "燄"),
      ("{{w_45931}}", "𣴴"),
      ("{{w_45932}}", "忩"),
      ("{{w_45933}}", "疒"),
      ("{{w_45934}}", "癤"),
      ("{{w_45935}}", "眴"),
      ("{{w_45936}}", "矕"),
      ("{{w_45937}}", "睺"),
      ("{{w_45938}}", "毗"),
      ("{{w_45939}}", "𥝱"),
      ("{{w_45940}}", "稭"),
      ("{{w_45941}}", "皁"),
      ("{{w_45942}}", "耮"),
      ("{{w_45943}}", "翩"),
      ("{{w_45944}}", "舢"),
      ("{{w_45945}}", "艘"),
      ("{{w_45946}}", "醺"),
      ("{{w_45947}}", "跑"),
      ("{{w_45948}}", "躇"),
      ("{{w_45950}}", "諛"),
      ("{{w_46113}}", "躻"),
      ("{{w_46114}}", "餛"),
      ("{{w_46115}}", "顬"),
      ("{{w_46116}}", "骶"),
      ("{{w_46117}}", "鶍"),
      ("{{w_46118}}", "鴲"),
      ("{{w_46119}}", "鵼"),
      ("{{w_46120}}", "鼹"),
      ("{{w_46121}}", "鸊"),
      ("{{w_46122}}", "鷉"),
      ("{{w_46123}}", "鵇"),
      ("{{w_46124}}", "𦼠"),
      ("{{w_46125}}", "䕟"),
      ("{{w_46126}}", "坼"),
      ("{{w_46127}}", "桲"),
      ("{{w_46128}}", "祛"),
      ("{{w_46129}}", "蛼"),
      ("{{w_46130}}", "瘀"),
      ("{{w_46131}}", "㚑"),
      ("{{w_46132}}", "<unencoded>"),
      ("{{w_46133}}", "鯸"),
      ("{{w_46134}}", "鯼"),
      ("{{w_46135}}", "䱌"),
      ("{{w_46136}}", "𩸽"),
      ("{{w_46137}}", "鱲"),
      ("{{w_46138}}", "𩺊"),
      ("{{w_46139}}", "鱗"),
      ("{{w_46140}}", "麞"),
      ("{{w_46141}}", "艹"),
      ("{{w_46142}}", "𥫗"),
      ("{{w_46143}}", "𠃋"),
      ("{{w_46144}}", "丆"),
      ("{{w_46170}}", "<unencoded>"),
      ("{{w_46171}}", "𛁅"),
      ("{{w_46183}}", "⇒"),
      ("{{w_46184}}", "⇔"),
      ("{{w_46386}}", "ṃ"),
      ("{{w_46387}}", "ś"),
      ("{{w_46388}}", "š"),
      ("{{w_46389}}", "ȳ"),
      ("{{w_46390}}", "<unencoded>"),
      ("{{w_46391}}", "𪜈"),
      ("{{w_46395}}", "𝄐"),
      ("{{w_46396}}", "<unencoded>"),
      ("{{w_46397}}", "𛂌"),
      ("{{w_46398}}", "𛂦"),
      ("{{w_46399}}", "♩"),
      ("{{w_46400}}", "𝅝"),
      ("{{w_46401}}", "⛩️"),
      ("{{w_46402}}", "♮"),
      ("{{w_46403}}", "㐂"),
      ("{{w_46404}}", "𛀸"),
      ("{{w_46405}}", "✓"),
      ("{{w_46406}}", "<unencoded>"),
      ("{{w_46407}}", "卐"),
      ("{{w_46414}}", "㇔"),
      ("{{w_46431}}", "⁎"),
      ("{{w_46432}}", "⁑"),
    );
}
